"""
1. Создайте игру «Угадай число». Программа загадывает
число(использовать random.randint).Далее пользователь пытается
угадать это число, если вводимое пользователем число больше,
загаданного программой, на экран выводится сообщение «Ваше число
больше загаданного» ,если меньше - «Ваше число меньше
загаданного», если пользователь угадал, вывести сообщение «Вы
угадали с …. попытки». – 1 балл
"""
import random

secret = random.randint(1, 100)
attempt = 0
while True:
    try:
        n = int(input())
    except ValueError:
        continue
    attempt += 1
    if n > secret:
        print("Ваше число больше загаданного")
    elif n < secret:
        print("Ваше число меньше загаданного")
    else:
        print(f"Вы угадали с {attempt} попытки")
        break
